       IDENTIFICATION DIVISION.
       PROGRAM-ID. FLOPPYRAID.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WRITE-BUFFER    PIC X(508) VALUE SPACES.
       01 READ-BUFFER     PIC X(508) VALUE SPACES.
       01 SECTOR-NUMBER   PIC 9(4) COMP VALUE 1.
       01 NUM-DISKS PIC S9(9) COMP-5 VALUE 3.
       01 PARITY-DISK     PIC 9 COMP.

       PROCEDURE DIVISION.
       MAIN-SECTION.
           MOVE "RAIDed by RETROFRACTURE" TO WRITE-BUFFER (1:23).

           COMPUTE PARITY-DISK = FUNCTION MOD (SECTOR-NUMBER NUM-DISKS) + 1.

           CALL "write_raid5_floppy"
               USING WRITE-BUFFER SECTOR-NUMBER PARITY-DISK NUM-DISKS.

           CALL "read_raid5_floppy"
               USING READ-BUFFER SECTOR-NUMBER PARITY-DISK NUM-DISKS.

           DISPLAY "READ BACK:" READ-BUFFER.

           STOP RUN.
